#Задача №1
x = int(input("Введите целое число: "))
if x < 100:
   n = print(* [x ** 2 for x in range(1, x + 1)])
   m = print(* [x ** 3 for x in range(1, x + 1)])
else:
    print ("Ошибка! Недопустимое число. Число должно быть от 1 до 100.")
